# Higher Educational Pursuit & CBSAs

### Question: Is there a correlation between higher educational pursuit and CBSAs (Core Based Statistical Areas)?

#### Datasets Needed:
###### 1. Advanced Placement
###### 2. Dual Enrollment
###### 3. SAT and ACT
###### 4. grf17_lea_cbsa
###### 5. LEA Characteristics

#### Columns Needed:

##### For All: ['LEAID']
###### 1. ['TOT_APEXAM_ONEORMORE_F', 'TOT_APEXAM_ONEORMORE_M']
###### 2. ['TOT_DUAL_M', 'TOT_DUAL_F']
###### 3. ['TOT_SATACT_M', 'TOT_SATACT_F']
###### 4. ['CBSA', 'NAME_CBSA17']
###### 5. ['LEA_ENR']

In [93]:
import pandas as pd
def ap_dataframe():
    columns = ['LEAID','TOT_APEXAM_ONEORMORE_F', 'TOT_APEXAM_ONEORMORE_M']
    
    ap_df = pd.read_csv('C:/Users/evanj/OneDrive/Documents/2017-18 Public-Use Files/Data/SCH/CRDC/CSV/Advanced Placement.csv',usecols=columns, encoding='ISO-8859-1', index_col='LEAID', dtype={'LEAID': str, 'TOT_APEXAM_ONEORMORE_F': int, 'TOT_APEXAM_ONEORMORE_M': int})
    
    ap_df = ap_df[(ap_df['TOT_APEXAM_ONEORMORE_F'] >= 0) & (ap_df['TOT_APEXAM_ONEORMORE_M'] >= 0)]
    
    ap_df = ap_df.groupby('LEAID').sum()
    
    ap_df['TOT_APEXAM_ONEORMORE'] = ap_df['TOT_APEXAM_ONEORMORE_F'] + ap_df['TOT_APEXAM_ONEORMORE_M']
    ap_df = ap_df.drop(['TOT_APEXAM_ONEORMORE_F', 'TOT_APEXAM_ONEORMORE_M'], axis=1)

    return ap_df

In [94]:
ap_dataframe()

         TOT_APEXAM_ONEORMORE
LEAID
0100005                   286
0100006                   597
0100007                   926
0100008                   701
0100011                   105
...                       ...
5605762                    55
5605830                   242
5606090                     6
5606240                    43
7200030                  4323

[8126 rows x 1 columns]

In [95]:
def dual_dataframe():
    columns = ['LEAID','TOT_DUAL_F', 'TOT_DUAL_M']

    dual_df = pd.read_csv('C:/Users/evanj/OneDrive/Documents/2017-18 Public-Use Files/Data/SCH/CRDC/CSV/Dual Enrollment.csv',usecols=columns, encoding='ISO-8859-1', index_col='LEAID', dtype={'LEAID': str, 'TOT_DUAL_F': int, 'TOT_DUAL_M': int})
    
    dual_df = dual_df[(dual_df['TOT_DUAL_F'] >= 0) & (dual_df['TOT_DUAL_M'] >= 0)]

    dual_df = dual_df.groupby('LEAID').sum()

    dual_df['TOT_DUAL'] = dual_df['TOT_DUAL_F'] + dual_df['TOT_DUAL_M']
    dual_df = dual_df.drop(['TOT_DUAL_F', 'TOT_DUAL_M'], axis=1)

    return dual_df

In [96]:
dual_dataframe()

         TOT_DUAL
LEAID
0100005        34
0100006       108
0100007       227
0100008       176
0100009         6
...           ...
5605820         3
5605830       424
5606090        41
5606240        52
5680251         5

[10148 rows x 1 columns]

In [97]:
def sat_act_dataframe():
    columns = ['LEAID','TOT_SATACT_F', 'TOT_SATACT_M']

    sat_act_df = pd.read_csv('C:/Users/evanj/OneDrive/Documents/2017-18 Public-Use Files/Data/SCH/CRDC/CSV/SAT and ACT.csv',usecols=columns, encoding='ISO-8859-1', index_col='LEAID', dtype={'LEAID': str, 'TOT_SATACT_F': int, 'TOT_SATACT_M': int})
    
    sat_act_df = sat_act_df[(sat_act_df['TOT_SATACT_F'] >= 0) & (sat_act_df['TOT_SATACT_M'] >= 0)]

    sat_act_df = sat_act_df.groupby('LEAID').sum()

    sat_act_df['TOT_SATACT'] = sat_act_df['TOT_SATACT_F'] + sat_act_df['TOT_SATACT_M']
    sat_act_df = sat_act_df.drop(['TOT_SATACT_F', 'TOT_SATACT_M'], axis=1)

    return sat_act_df

In [98]:
sat_act_dataframe()

         TOT_SATACT
LEAID
0100002          33
0100005         363
0100006         382
0100007        1836
0100008        1012
...             ...
5680251          20
5680252          16
5680254          40
5680255           2
7200030           0

[13222 rows x 1 columns]

In [99]:
def cbsa_dataframe():
    columns = ['LEAID','CBSA', 'NAME_CBSA17']

    cbsa_df = pd.read_excel('D:\Data\GRF17\GRF17\grf17_lea_cbsa.xlsx', usecols=columns, index_col=0, dtype={'LEAID': str, 'CBSA': int, 'NAME_CBSA17': str})

    cbsa_df = cbsa_df.groupby('LEAID').sum()

    return cbsa_df

In [100]:
cbsa_dataframe()

           CBSA                                        NAME_CBSA17
LEAID
0100001   58580      Enterprise, AL Micro AreaOzark, AL Micro Area
0100003   33860                          Montgomery, AL Metro Area
0100005   10700                         Albertville, AL Micro Area
0100006   10700                         Albertville, AL Micro Area
0100007   13820                   Birmingham-Hoover, AL Metro Area
...         ...                                                ...
6000030       0                                        NOT IN CBSA
6600040       0                                        NOT IN CBSA
6900030       0                                        NOT IN CBSA
7200030  317280  NOT IN CBSAAdjuntas, PR Micro AreaAguadilla-Is...
7800030       0                                        NOT IN CBSA

[13331 rows x 2 columns]

In [128]:
def enr_dataframe():
    columns = ['LEAID','LEA_ENR']

    enr_df = pd.read_csv('C:/Users/evanj/OneDrive/Documents/2017-18 Public-Use Files/Data/LEA/CRDC/CSV/LEA Characteristics.csv',usecols=columns, encoding='ISO-8859-1', index_col='LEAID', dtype={'LEAID': str, 'LEA_ENR': int})

    enr_df = enr_df[(enr_df['LEA_ENR'] >= 0)]

    return enr_df

In [129]:
enr_dataframe()

         LEA_ENR
LEAID
0100002      280
0100005     5445
0100006     5698
0100007    14372
0100008    10810
...          ...
5680251      162
5680252       34
5680254      243
5680255       31
7200030   348303

[17603 rows x 1 columns]

In [101]:
df_ap = ap_dataframe()

In [102]:
df_dual = dual_dataframe()

In [103]:
df_sat_act = sat_act_dataframe()

In [104]:
df_cbsa = cbsa_dataframe()

In [130]:
df_enr = enr_dataframe()

In [105]:
ap_dual_df = df_ap.merge(df_dual, how= 'inner', on = 'LEAID')

ap_dual_df

         TOT_APEXAM_ONEORMORE  TOT_DUAL
LEAID
0100005                   286        34
0100006                   597       108
0100007                   926       227
0100008                   701       176
0100011                   105         1
...                       ...       ...
5605695                   137        65
5605762                    55        98
5605830                   242       424
5606090                     6        41
5606240                    43        52

[6776 rows x 2 columns]

In [106]:
ap_dual_satact_df = ap_dual_df.merge(df_sat_act, how= 'inner', on = 'LEAID')

ap_dual_satact_df

         TOT_APEXAM_ONEORMORE  TOT_DUAL  TOT_SATACT
LEAID
0100005                   286        34         363
0100006                   597       108         382
0100007                   926       227        1836
0100008                   701       176        1012
0100011                   105         1          97
...                       ...       ...         ...
5605695                   137        65         314
5605762                    55        98         287
5605830                   242       424         176
5606090                     6        41          18
5606240                    43        52          42

[6776 rows x 3 columns]

In [131]:
ap_dual_satact_cbsa_df = ap_dual_satact_df.merge(df_cbsa, how= 'inner', on = 'LEAID')

ap_dual_satact_cbsa_df

,TOT_APEXAM_ONEORMORE,TOT_DUAL,TOT_SATACT,CBSA,NAME_CBSA17
LEAID,,,,,
0100005,286,34,363,10700,"Albertville, AL Micro Area"
0100006,597,108,382,10700,"Albertville, AL Micro Area"
0100007,926,227,1836,13820,"Birmingham-Hoover, AL Metro Area"
0100008,701,176,1012,26620,"Huntsville, AL Metro Area"
0100011,105,1,97,13820,"Birmingham-Hoover, AL Metro Area"
...,...,...,...,...,...
5605695,137,65,314,43260,"Sheridan, WY Micro Area"
5605762,55,98,287,40540,"Rock Springs, WY Micro Area"
5605830,242,424,176,27220,"Jackson, WY-ID Micro Area"
5606090,6,41,18,0,NOT IN CBSA
5606240,43,52,42,0,NOT IN CBSA

In [132]:
ap_dual_satact_cbsa_enr_df = ap_dual_satact_cbsa_df.merge(df_enr, how= 'inner', on = 'LEAID')

ap_dual_satact_cbsa_enr_df

,TOT_APEXAM_ONEORMORE,TOT_DUAL,TOT_SATACT,CBSA,NAME_CBSA17,LEA_ENR
LEAID,,,,,,
0100005,286,34,363,10700,"Albertville, AL Micro Area",5445
0100006,597,108,382,10700,"Albertville, AL Micro Area",5698
0100007,926,227,1836,13820,"Birmingham-Hoover, AL Metro Area",14372
0100008,701,176,1012,26620,"Huntsville, AL Metro Area",10810
0100011,105,1,97,13820,"Birmingham-Hoover, AL Metro Area",2027
...,...,...,...,...,...,...
5605695,137,65,314,43260,"Sheridan, WY Micro Area",3546
5605762,55,98,287,40540,"Rock Springs, WY Micro Area",2607
5605830,242,424,176,27220,"Jackson, WY-ID Micro Area",2871
5606090,6,41,18,0,NOT IN CBSA,256
5606240,43,52,42,0,NOT IN CBSA,1284

In [136]:
new_order = ['CBSA', 'NAME_CBSA17', 'LEA_ENR', 'TOT_APEXAM_ONEORMORE', 'TOT_DUAL', 'TOT_SATACT']

complete_df = ap_dual_satact_cbsa_enr_df[new_order]

complete_df

,CBSA,NAME_CBSA17,LEA_ENR,TOT_APEXAM_ONEORMORE,TOT_DUAL,TOT_SATACT
LEAID,,,,,,
0100005,10700,"Albertville, AL Micro Area",5445,286,34,363
0100006,10700,"Albertville, AL Micro Area",5698,597,108,382
0100007,13820,"Birmingham-Hoover, AL Metro Area",14372,926,227,1836
0100008,26620,"Huntsville, AL Metro Area",10810,701,176,1012
0100011,13820,"Birmingham-Hoover, AL Metro Area",2027,105,1,97
...,...,...,...,...,...,...
5605695,43260,"Sheridan, WY Micro Area",3546,137,65,314
5605762,40540,"Rock Springs, WY Micro Area",2607,55,98,287
5605830,27220,"Jackson, WY-ID Micro Area",2871,242,424,176
5606090,0,NOT IN CBSA,256,6,41,18
5606240,0,NOT IN CBSA,1284,43,52,42

In [137]:
metro_regex = r'\bMetro\b'

metro_mask = complete_df['NAME_CBSA17'].str.contains(metro_regex, case=True, regex=True)

metro_df = complete_df[metro_mask]

metro_df

,CBSA,NAME_CBSA17,LEA_ENR,TOT_APEXAM_ONEORMORE,TOT_DUAL,TOT_SATACT
LEAID,,,,,,
0100007,13820,"Birmingham-Hoover, AL Metro Area",14372,926,227,1836
0100008,26620,"Huntsville, AL Metro Area",10810,701,176,1012
0100011,13820,"Birmingham-Hoover, AL Metro Area",2027,105,1,97
0100012,34160,"Albertville, AL Micro AreaGadsden, AL Metro Area",2379,117,23,251
0100013,13820,"Birmingham-Hoover, AL Metro Area",4561,381,75,357
...,...,...,...,...,...,...
5517040,44200,"NOT IN CBSABaraboo, WI Micro AreaMadison, WI M...",1713,61,157,89
5517100,91160,"Shawano, WI Micro AreaWausau, WI Metro Area",1164,37,184,71
5517190,36120,"Appleton, WI Metro AreaGreen Bay, WI Metro Area",1336,55,198,139
5601980,16940,"Cheyenne, WY Metro Area",14274,634,740,1120
5604510,16220,"Casper, WY Metro Area",13272,164,502,1067

In [138]:
metro_ap_average = metro_df['TOT_APEXAM_ONEORMORE'].mean()
metro_dual_average = metro_df['TOT_DUAL'].mean()
metro_sat_act_average = metro_df['TOT_SATACT'].mean()
metro_enr_average = metro_df['LEA_ENR'].mean()

metro_average_dict = {
    'ap': metro_ap_average / metro_enr_average,
    'dual': metro_dual_average / metro_enr_average,
    'sat_act': metro_sat_act_average / metro_enr_average
}

metro_average_dict

{'ap': 0.053765775328204035,
 'dual': 0.031254668241661496,
 'sat_act': 0.07988554872009455}

In [139]:
micro_regex = r'\bMicro\b'

micro_mask = complete_df['NAME_CBSA17'].str.contains(micro_regex, case=True, regex=True)

micro_df = complete_df[micro_mask]

micro_df

,CBSA,NAME_CBSA17,LEA_ENR,TOT_APEXAM_ONEORMORE,TOT_DUAL,TOT_SATACT
LEAID,,,,,,
0100005,10700,"Albertville, AL Micro Area",5445,286,34,363
0100006,10700,"Albertville, AL Micro Area",5698,597,108,382
0100012,34160,"Albertville, AL Micro AreaGadsden, AL Metro Area",2379,117,23,251
0100030,10760,"Alexander City, AL Micro Area",3035,124,29,227
0100100,29680,"Albertville, AL Micro AreaCullman, AL Micro Area",2603,168,10,173
...,...,...,...,...,...,...
5602870,40180,"Riverton, WY Micro Area",1778,83,188,160
5605302,40540,"Rock Springs, WY Micro Area",5547,168,116,153
5605695,43260,"Sheridan, WY Micro Area",3546,137,65,314
5605762,40540,"Rock Springs, WY Micro Area",2607,55,98,287
5605830,27220,"Jackson, WY-ID Micro Area",2871,242,424,176

In [140]:
micro_ap_average = micro_df['TOT_APEXAM_ONEORMORE'].mean()
micro_dual_average = micro_df['TOT_DUAL'].mean()
micro_sat_act_average = micro_df['TOT_SATACT'].mean()
micro_enr_average = micro_df['LEA_ENR'].mean()

micro_average_dict = {
    'ap': micro_ap_average / micro_enr_average,
    'dual': micro_dual_average / micro_enr_average,
    'sat_act': micro_sat_act_average / micro_enr_average
}

micro_average_dict

{'ap': 0.02800887523608169,
 'dual': 0.04287740772563873,
 'sat_act': 0.07067224581615056}

In [141]:
not_regex = r'\bNOT\b'

not_mask = complete_df['NAME_CBSA17'].str.contains(not_regex, case=True, regex=True)

not_df = complete_df[not_mask]

not_df

,CBSA,NAME_CBSA17,LEA_ENR,TOT_APEXAM_ONEORMORE,TOT_DUAL,TOT_SATACT
LEAID,,,,,,
0100060,0,NOT IN CBSA,1773,2,36,126
0100630,0,NOT IN CBSA,3939,57,71,344
0100720,0,NOT IN CBSA,2569,18,63,255
0100780,0,NOT IN CBSA,2584,122,131,161
0100930,0,NOT IN CBSA,3117,6,150,239
...,...,...,...,...,...,...
5604060,0,NOT IN CBSA,2888,12,12,298
5605090,0,NOT IN CBSA,1047,9,102,80
5605160,0,NOT IN CBSA,1835,0,172,187
5606090,0,NOT IN CBSA,256,6,41,18
5606240,0,NOT IN CBSA,1284,43,52,42

In [142]:
not_ap_average = not_df['TOT_APEXAM_ONEORMORE'].mean()
not_dual_average = not_df['TOT_DUAL'].mean()
not_sat_act_average = not_df['TOT_SATACT'].mean()
not_enr_average = not_df['LEA_ENR'].mean()

not_average_dict = {
    'ap': not_ap_average / not_enr_average,
    'dual': not_dual_average / not_enr_average,
    'sat_act': not_sat_act_average / not_enr_average
}

not_average_dict

{'ap': 0.023013494417441806,
 'dual': 0.04590138926822496,
 'sat_act': 0.0709313276376594}

         LEA_ENR
LEAID
0100002      280
0100005     5445
0100006     5698
0100007    14372
0100008    10810
...          ...
5680251      162
5680252       34
5680254      243
5680255       31
7200030   348303

[17603 rows x 1 columns]